# Basic

In [1]:
print("hello")

hello

 - DS - interdisiplinary field that uses methods, processes and systems to extract knowledge or insights from data
 - steps
   - data collection
   - data cleaning / preparation -  so that it is ready for analysis
   - exploratory data analysis (EDA) - to understand the data
   - data modeling - to create predictive models
   - data visualization - to communicate findings
   - model evaluation - to assess model performance
   - deployment - to integrate model into production

# Pandas
- lib for data manipulation and analysis
- DataFrame and Series - structures for tabular and 1D data
- Read/write - load/save data from CSV, Excel, SQL, etc.
- Powerful indexing and slicing - filter, group, pivot tables and more
- Handling missing data - for detecting and filling missing values

## Dataframe related basics
used coz easier to analyze and everything

In [ ]:
import pandas as pd

data = {
    'A' : [1, 2, 3],
    'B' : ['x', 'y', 'z'],
    'C' : [0.5, 0.75, 1.0]
}

df = pd.DataFrame(data)
print(df)

   A  B     C
0  1  x  0.50
1  2  y  0.75
2  3  z  1.00
   A  B     C
0  1  x  0.50
1  2  y  0.75
2  3  z  1.00

In [13]:
print(df.head(2))
print("--------------")
print(df.tail(1))
print("-----Shape---------")
print(df.shape)
print("-------Info-------")
print(df.info())
print("-------Describe-------")
print(df.describe())

   A  B     C
0  1  x  0.50
1  2  y  0.75
--------------
   A  B    C
2  3  z  1.0
-----Shape---------
(3, 3)
-------Info-------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      object
 2   C       3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes
None
-------Describe-------
         A      C
count  3.0  3.000
mean   2.0  0.750
std    1.0  0.250
min    1.0  0.500
25%    1.5  0.625
50%    2.0  0.750
75%    2.5  0.875
max    3.0  1.000

In [16]:
print(df.iloc[0])  # Accessing the first row
print(df.loc[0, 'A'])  # Accessing the value in the first row and column 'A'

A      1
B      x
C    0.5
Name: 0, dtype: object
1

- loc for label-based indexing
- iloc for position-based indexing

In [37]:
data2 = {
    'Name': ['ABC', 'DEF', 'GHI'],
    'Score' : [85, 90, 95],
    'Passed' : ['Yes', 'Yes', 'Yes']
}

df2 = pd.DataFrame(data2, index=['a', 'b', 'c'])

print(df2.loc['a'])  # Accessing the row with index 'a'
print("--------------")
print(df2.loc['b', 'Name']) # Accessing the 'Name' column of row with index 'b'
print("--------------")
print(df2.iloc[0])
print("--------------")
print(df2.iloc[1, 0])  # Accessing the 'Name' of the second row
print("--------------")
print(df2.iloc[0:2]) # access rows 0 to 2 not end-1 
print("--------------")
print(df2.iloc[0:2, 0:1])

df

Name      ABC
Score      85
Passed    Yes
Name: a, dtype: object
--------------
DEF
--------------
Name      ABC
Score      85
Passed    Yes
Name: a, dtype: object
--------------
DEF
--------------
  Name  Score Passed
a  ABC     85    Yes
b  DEF     90    Yes
--------------
  Name
a  ABC
b  DEF

   A  B     C
0  1  x  0.50
1  2  y  0.75
2  3  z  1.00

## Filtering and selection

In [42]:
print(df['A'] > 1)

df['D'] = df['A'] * df['C']
df

0    False
1     True
2     True
Name: A, dtype: bool

   A  B     C    D
0  1  x  0.50  0.5
1  2  y  0.75  1.5
2  3  z  1.00  3.0

## Removing null

In [54]:
df = pd.DataFrame({
    'A' : [1, None, 3],
    'B' : [3, 2, None]
})

print(df.isnull().sum())  # Count of null values in each column
df

A    1
B    1
dtype: int64

     A    B
0  1.0  3.0
1  NaN  2.0
2  3.0  NaN

In [55]:
df2 = df.dropna()  # Drop rows with any null values
df2

     A    B
0  1.0  3.0

# Hands on

In [ ]:
import pandas as pd

df = pd.read_csv('student_performance.csv')

print(df.head(2))
print("------INFO--------")
print(df.info())
print("------Describe--------")
print(df.describe())
print("--------------")

   StudentID       Name Gender  MathScore  ScienceScore  EnglishScore  \
0          1  Student_1      M         86            68          81.0
1          2  Student_2      F         90            96           NaN

   StudyHours Passed
0           6    Yes
1           7    Yes
------INFO--------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   StudentID     50 non-null     int64
 1   Name          50 non-null     object
 2   Gender        50 non-null     object
 3   MathScore     50 non-null     int64
 4   ScienceScore  50 non-null     int64
 5   EnglishScore  47 non-null     float64
 6   StudyHours    50 non-null     int64
 7   Passed        50 non-null     object
dtypes: float64(1), int64(4), object(3)
memory usage: 3.2+ KB
None
------Describe--------
       StudentID   MathScore  ScienceScore  EnglishScore  StudyHours
count   50.00000   50.000000     50.000000     47.000000   50.000000
mean    25.50000   70.780000     65.740000     66.851064    5.280000
std     14.57738   19.699052     19.930297     21.125895    2.828716
min      1.00000   41.000000     35.000000     30.000000    1.000000
25%     13.25000   53.000000     48.000000     54.500000    3.000000
50%     25.50000   74.500000     67.500000     68.000000    5.500000
75%     37.75000   89.000000     80.500000     86.500000    7.000000
max     50.00000  100.000000     99.000000    100.000000   10.000000
--------------

In [72]:
subset  = df.loc[0:4 , ['Name','MathScore','Passed']]
print(subset)

print("----------------------------------------")

passed_students = df[df['Passed'] == 'Yes']
print("Passed Students:", passed_students.shape)

        Name  MathScore Passed
0  Student_1         86    Yes
1  Student_2         90    Yes
2  Student_3         83    Yes
3  Student_4         94    Yes
4  Student_5         91    Yes
----------------------------------------
Passed Students: (48, 8)

In [73]:
print(df.isnull().sum())  # Count of null values in each column

StudentID       0
Name            0
Gender          0
MathScore       0
ScienceScore    0
EnglishScore    3
StudyHours      0
Passed          0
dtype: int64

In [ ]:
df_clean = df.dropna(subset=['EnglishScore'])

StudentID       0
Name            0
Gender          0
MathScore       0
ScienceScore    0
EnglishScore    0
StudyHours      0
Passed          0
dtype: int64

In [94]:
df_clean = df_clean.rename(columns={'StudyHours': 'HoursStudied'})
df_clean['HoursStudied'] = df_clean['HoursStudied'].astype(int)

df_clean.head(5)

,StudentID,Name,Gender,MathScore,ScienceScore,EnglishScore,HoursStudied,Passed,AverageScore
0,1,Student_1,M,86,68,81.0,6,Yes,78.333333
2,3,Student_3,M,83,48,52.0,5,Yes,61.000000
3,4,Student_4,M,94,82,44.0,1,Yes,73.333333
4,5,Student_5,M,91,49,72.0,1,Yes,70.666667
5,6,Student_6,F,96,96,58.0,3,Yes,83.333333

In [96]:
df_clean['AverageScore'] = df_clean[['MathScore', 'ScienceScore', 'EnglishScore']].mean(axis=1)

df_clean.head(5)

,StudentID,Name,Gender,MathScore,ScienceScore,EnglishScore,HoursStudied,Passed,AverageScore
0,1,Student_1,M,86,68,81.0,6,Yes,78.333333
2,3,Student_3,M,83,48,52.0,5,Yes,61.000000
3,4,Student_4,M,94,82,44.0,1,Yes,73.333333
4,5,Student_5,M,91,49,72.0,1,Yes,70.666667
5,6,Student_6,F,96,96,58.0,3,Yes,83.333333

In [97]:
df_sorted = df_clean.sort_values(by='AverageScore', ascending=False)
df_sorted.head(5)

,StudentID,Name,Gender,MathScore,ScienceScore,EnglishScore,HoursStudied,Passed,AverageScore
38,39,Student_39,M,79,99,81.0,7,Yes,86.333333
15,16,Student_16,M,64,99,91.0,6,Yes,84.666667
22,23,Student_23,F,92,69,91.0,1,Yes,84.000000
26,27,Student_27,F,86,75,91.0,4,Yes,84.000000
19,20,Student_20,M,97,97,57.0,2,Yes,83.666667

In [98]:
df_sorted.to_csv('cleaned_student_performance.csv', index=False)